renesas/rx-driver-package/source/r_mesh_rx23w/r_mesh_rx23w_vx.xx/r_mesh_rx23w/src/include/MS_common.h
/** Device UUID Size */
#define MS_DEVICE_UUID_SIZE    16

/** Beacon Type - Size */
#define MS_BCON_TYPE_SIZE      1

/** Beacon OOB Indicator Size */
#define MS_BCON_OOB_IND_SIZE   2

/** Beacon URI Hash Size */
#define MS_BCON_URI_HASH_SIZE   4

/** Beacon Types */
/** Unprovisioned Device Beacon Type */
#define MS_BCON_TYPE_UNPRVSNG_DEV    0x00

/* Secure Network Beacon Type */
#define MS_BCON_TYPE_SECURE          0x01

/** Friend Role */
/* Invalid */
#define MS_FRND_ROLE_INVALID   0x00

/* Friend */
#define MS_FRND_ROLE_FRIEND    0x01

/* LPN */
#define MS_FRND_ROLE_LPN       0x02

/** Relay Feature */
#define MS_FEATURE_RELAY    0x00
/** Proxy Feature */
#define MS_FEATURE_PROXY    0x01
/** Friend Feature */
#define MS_FEATURE_FRIEND   0x02
/** Low Power Feature */
#define MS_FEATURE_LPN      0x03

/** Secure Nework Beacon */
#define MS_FEATURE_SEC_NET_BEACON 0x04

/** Operation: Enable */
#define MS_ENABLE           0x01
/** Operation: Disable */
#define MS_DISABLE          0x00
/**
 * Feature not supported.
 * Used as stutus for Get/Set Friend/Proxy etc.,
 * when the feature is not supported.
 */
#define MS_NOT_SUPPORTED    0x02

/** Network Tx State */
#define MS_NETWORK_TX_STATE            0x00
/** Relay Tx State */
#define MS_RELAY_TX_STATE              0x01

/** Label UUID Length. Associated with Virtual Address */
#define MS_LABEL_UUID_LENGTH           16

/** \} */

/* -------------------------------------------- Structures/Data Types */

/**
 * \addtogroup ms_common_defines Defines
 * \{
 */

/**
 * \defgroup ms_common_structures Structures
 * \{
 */
/** Payload type */
typedef struct _MS_BUFFER
{
    /* Payload Pointer */
    UCHAR * payload;

    /* Payload Length */
    UINT16 length;

} MS_BUFFER;

/**
 *  Dynamic configuration of Mesh Datastructure.
 *  Used only if 'MS_HAVE_DYNAMIC_GLOBAL_ARRAY' is defined.
 */
typedef struct _MS_CONFIG
{
#ifdef MS_HAVE_DYNAMIC_GLOBAL_ARRAY
    /** Number of Network Interfaces */
    UINT16 config_MS_NUM_NETWORK_INTERFACES;

    /** Number of Provisioning Interfaces */
    UINT16 config_MS_NUM_PROVISIONING_INTERFACES;

    /** Network Cache Size */
    UINT16 config_MS_NET_CACHE_SIZE;

    /** Maximum number of subnets the device can store information about. */
    UINT16 config_MS_MAX_SUBNETS;

    /** Maximum number of device keys the device can store information about. */
    UINT16 config_MS_MAX_DEV_KEYS;

    /** Maximum number of addresses present in each proxy filter list. */
    UINT16 config_MS_PROXY_FILTER_LIST_SIZE;

    /** Maximum number of LPNs. */
    UINT16 config_MS_MAX_LPNS;

    /** The size of Reassembled Cache. */
    UINT16 config_MS_REASSEMBLED_CACHE_SIZE;

    /** Number of Segmentation and Reassembly contexts. */
    UINT16 config_LTRN_SAR_CTX_MAX;

    /**
     *  Maximum number of messages that the friend is capabale to queue
     *  for a single Low Power Node.
     */
    UINT16 config_MS_FRIEND_MESSAGEQUEUE_SIZE;

    /**
     *  Maximum number of subscription addresses that the friend
     *  is capabale to store for a single Low Power Node.
     */
    UINT16 config_MS_FRIEND_SUBSCRIPTION_LIST_SIZE;

    /** Maximum number of elements. */
    UINT16 config_MS_ACCESS_ELEMENT_COUNT;

    /** Maximum number of models. */
    UINT16 config_MS_ACCESS_MODEL_COUNT;

    /**
     *  Maximum number of Applications (keys) the device can store
     *  information about.
     */
    UINT16 config_MS_MAX_APPS;

    /**
     *  Maximum number of Virtual Addresses the device can store
     *  information about.
     */
    UINT16 config_MS_MAX_VIRTUAL_ADDRS;

    /**
     *  Maximum number of Non-Virtual Addresses the device can store
     *  information about.
     */
    UINT16 config_MS_MAX_NON_VIRTUAL_ADDRS;

    /**
     *  The distance between the network sequence numbers, for every persistent
     *  storage write. If the device is powered cycled, it will resume transmission
     *  using the sequence number from start of next block.
     */
    UINT16 config_MS_NET_SEQ_NUMBER_BLOCK_SIZE;

    /**
     *  Maximum number of Health Server Instances.
     */
    UINT16 config_MS_HEALTH_SERVER_MAX;
#endif /* MS_HAVE_DYNAMIC_GLOBAL_ARRAY */

    /** The size of the Replay Protection cache. */
    UINT16 config_MS_REPLAY_CACHE_SIZE;

    /** Company ID */
    UINT16 config_MS_DEFAULT_COMPANY_ID;

    /** Product ID */
    UINT16 config_MS_DEFAULT_PID;

    /** Vendor ID */
    UINT16 config_MS_DEFAULT_VID;

} MS_CONFIG;

/** \} */

/** \} */

/* -------------------------------------------- Function/API Declarations */
#ifdef __cplusplus
extern "C"{
#endif

#ifdef MS_HAVE_DYNAMIC_CONFIG
/* Global Configuration for Mesh Stack */
extern MS_CONFIG ms_global_config;
#endif /* MS_HAVE_DYNAMIC_CONFIG */

/**
 * \defgroup ms_common_api API Definitions
 * \{
 */

/**
 * API to initialize Mesh Stack. This is the first API that the
 * application should call before any other API. This function
 * initializes all the internal stack modules and creates necessary tasks.
 *
 * \note
 */

/**
 *  \brief To initialize Mesh Stack.
 *
 *  \par Description
 *  API to initialize Mesh Stack. This is the first API that the
 *  application should call before any other API. This function
 *  initializes all the internal stack modules and data structures.
 *
 *  \param [in] blob
 *         If 'MS_HAVE_DYNAMIC_CONFIG' defined,
 *             application shall provide the desired dynamic configuration
 *             using a pointer to MS_CONFIG data structure instance.
 *         else,
 *             this parameter shall be NULL and ignored by the API.
 *
 *  \return API_SUCCESS or an error code indicating reason for failure
 */
void MS_init
     (
         /* IN */ void * blob
     );

/**
 * API to turn off Bluetooth Hardware. This API should be called after
 * \ref MS_init.
 *
 * \return
 *      \ref API_RESULT on successful Bluetooth OFF
 */
API_RESULT MS_shutdown
           (
               void
           );

/**
 *  \brief To start transition timer.
 *
 *  \par Description
 *  API to start a transition timer.
 *
 *  \param [in] transition
 *         State Transition data structure, which includes the timeout,
 *         transition start and complete callback etc.
 *
 *  \param [out] transition_time_handle
 *         Transition Time Handle, which can be used to stop the transition
 *         timer if required.
 *
 *  \return API_SUCCESS or an error code indicating reason for failure
 */
API_RESULT MS_common_start_transition_timer
           (
               /* IN */  MS_ACCESS_STATE_TRANSITION_TYPE   * transition,
               /* OUT */ UINT16                            * transition_time_handle
           );

/**
 *  \brief To stop transition timer.
 *
 *  \par Description
 *  API to stop a transition timer.
 *
 *  \param [in] transition_time_handle
 *         Transition Time Handle, returned by the Start Transition Timer
 *         interface.
 *
 *  \return API_SUCCESS or an error code indicating reason for failure
 */
API_RESULT MS_common_stop_transition_timer
           (
               /* IN */ UINT16  transition_time_handle
           );

/**
 *  \brief To get remaining Transition Time.
 *
 *  \par Description
 *  API to get remaining Transition Time.
 *
 *  \param [in] transition_time_handle
 *         Transition Time Handle, returned by the Start Transition Timer
 *         interface.
 *
 *  \param [out] remaining_transition_time
 *         Remaining Transition Time.
 *
 *  \return API_SUCCESS or an error code indicating reason for failure
 */
API_RESULT MS_common_get_remaining_transition_time
           (
               /* IN */  UINT16   transition_time_handle,
               /* OUT */ UINT8  * remaining_transition_time
           );

/**
 *  \brief To get remaining Transition Time, with offset.
 *
 *  \par Description
 *  API to get remaining Transition Time with offset in ms.
 *
 *  \param [in] transition_time_handle
 *         Transition Time Handle, returned by the Start Transition Timer
 *         interface.
 *
 *  \param [in] offset_in_ms
 *         Offset in ms.
 *
 *  \param [out] remaining_transition_time
 *         Remaining Transition Time.
 *
 *  \return API_SUCCESS or an error code indicating reason for failure
 */
API_RESULT MS_common_get_remaining_transition_time_with_offset
           (
               /* IN */  UINT16   transition_time_handle,
               /* IN */  UINT32   offset_in_ms,
               /* OUT */ UINT8  * remaining_transition_time
           );

/**
 *  \brief To convert transition time from milisecond.
 *
 *  \par Description
 *  API to convert transition timer in milisecond to Generic Default
 *  Transition Time state format.
 *
 *  \param [in] transition_time_in_ms
 *         Transition Time in milisecond.
 *
 *  \param [out] transition_time
 *         Converted value in Generic Default Transition Time state format.
 *
 *  \return API_SUCCESS or an error code indicating reason for failure
 */
API_RESULT MS_common_get_transition_time_from_ms
           (
               /* IN */  UINT32 transition_time_in_ms,
               /* OUT */ UINT8 * transition_time
           );

/**
 * \cond ignore_this Ignore this function while generating doxygen document
 */

/* Internal Function */
API_RESULT ms_common_init_transition_timer(void);

/**
 * \endcond
 */

#ifdef __cplusplus
};
#endif

/** \} */

/** \} */

#endif /* _H_MS_COMMON_ */

